Repository: i2002/course-resources
Catalog: lang/course-resources-*.po
Languages: ro_ro

source: Course resources
ro_ro: Materiale curs

source: Manage course files and student access.
ro_ro: Gestionează accesul studenților la materialele de curs.

source: Course resources - Options
ro_ro: Materiale curs - Setări

source: Options
ro_ro: Setări

source: Course files
ro_ro: Fișiere curs

source: Student enrolment
ro_ro: Studenți înrolați

source: Duration in seconds of login token validity
ro_ro: Durata în secunde a validității unui token de login

source: Duration in seconds of email login link validity
ro_ro: Durata în secunde a validității email-ului de login

source: Duration in seconds before requesting another login email
ro_ro: Durata în secunde până la permiterea cererii unui alt email de login

source: Security
ro_ro: Securitate

source: Login expiration time
ro_ro: Timp expirare login

source: How long a session is valid until a new sign in is required (value in seconds)
ro_ro: Valabilitatea unei sesiuni până când este necesară reautentificarea studentului (durată în secunde)

source: Revoke login tokens
ro_ro: Resetează token-uri de autentificare

source: Login email expiration time
ro_ro: Timp expirare email de autentificare

source: How long is the login email valid (value in seconds)
ro_ro: Valabilitatea link-ului de autentificare primit pe email (durată în secunde)

source: Login request cooldown
ro_ro: Timp între cereri succesive de autentificare

source: Minimum time between two consecutive login emails sent (value in seconds)
ro_ro: Durata de timp minima între două email-uri de autentificare consecutive către aceeași adresă (valoare în secunde)

source: Revoke sent login links
ro_ro: Resetează link-uri de autentificare trimise

source: Settings related to student login
ro_ro: Setări legate de autentificarea studenților

source: Reset
ro_ro: Resetare

source: Force logout all connected users
ro_ro: Deconectare forțată a tuturor utilizatorilor autentificați

source: Invalidate all login emails sent
ro_ro: Invalidează toate email-urile de autentificare trimise

source: Settings updated
ro_ro: Setări actualizate

source: Save Settings
ro_ro: Actualizare setări

source: Invalid user login code
ro_ro: Cod de verificare invalid

source: The provided email address is not enrolled in any course.
ro_ro: Adresa de email nu este înscrisă la niciun curs.

source: An email has already been sent.
ro_ro: A fost deja trimis un email.

source: Failed to send email. Please try again later.
ro_ro: Nu s-a putut trimite emailul. Încercați mai târziu.

source: Sign in to Course resources requested
ro_ro: Cerere autentificare Materiale curs

source: Hello,
ro_ro: Bună ziua,

source: We received a request to sign in to Course resources using this email address.
ro_ro: Am primit o cerere de autentificare în platforma Materiale curs folosind această adresă de email.

source: If you want to sign in with your %s account, use this code:
ro_ro: Dacă doriți să vă autentificați cu contul %s, folosiți codul următor:

source: If you did not request this, you can safely ignore this email.
ro_ro: Dacă nu ați cerut acest lucru, puteți să ignorați acest email în siguranță.

source: Courses
ro_ro: Cursuri

source: Course
ro_ro: Curs

# course
source: Add New
ro_ro: Adaugă curs nou

source: Add New Course
ro_ro: Adaugă curs nou

source: Edit Course
ro_ro: Editare curs

source: New Course
ro_ro: Curs nou

source: View Course
ro_ro: Vizualizare curs

source: View Courses
ro_ro: Vizualizare cursuri

source: Search Courses
ro_ro: Caută cursuri

source: No courses found
ro_ro: Niciun curs găsit

source: No courses found in Trash
ro_ro: Niciun curs găsit în coșul de gunoi

source: Course Archives
ro_ro: Arhive cursuri

source: Course Attributes
ro_ro: Atribute curs

source: Insert into course
ro_ro: Inserare la curs

source: Uploaded to this course
ro_ro: Încărcare la acest curs

source: Course published
ro_ro: Curs publicat

source: Course published privately
ro_ro: Curs publicat în mod privat

source: Course reverted to draft
ro_ro: Curs comutat la ciornă

source: Course scheduled
ro_ro: Curs planificat

source: Course updated
ro_ro: Curs actualizat

source: Folders
ro_ro: Dosare

source: Folder
ro_ro: Dosar

source: Allows organizing uploaded files in folders
ro_ro: Asigură organizarea fișierelor încărcate în dosare

source: Invalid file ID
ro_ro: ID fișier invalid

source: Sorry, you are not allowed to create files as this user.
ro_ro: Ne pare rău, nu ai dreptul de a crea fișiere cu acest utilizator.

source: Sorry, you are not allowed to upload files on this site.
ro_ro: Ne pare rău, nu ai dreptul de a încărca fișier pe acest site.

source: Sorry, you are not allowed to upload files to this course.
ro_ro: Ne pare rău, nu ai dreptul de a încărca fișiere la acest curs.

source: File parent required.
ro_ro: Părinte fișier necesar.

source: Invalid parent folder.
ro_ro: Părinte dosar invalid.

source: Course ID required.
ro_ro: ID curs necesar.

source: Invalid course.
ro_ro: Curs invalid.

source: File title required.
ro_ro: Titlu fișier necesar.

source: Bad request
ro_ro: Cerere incorectă

source: You need to log in to access this.
ro_ro: Trebuie să fiți autentificat pentru a accesa asta.

source: You are not enrolled in this course.
ro_ro: Nu sunteți înscris la acest curs.

source: Invalid folder ID.
ro_ro: ID dosar invalid.

source: Invalid course ID.
ro_ro: ID curs invalid.

source: Invalid parent folder ID.
ro_ro: Părinte dosar invalid.

source: None selected
ro_ro: Niciunul selectat

source: %s selected
ro_ro: %s selectat

source: Name
ro_ro: Nume

source: Size
ro_ro: Dimensiune

source: Last updated
ro_ro: Modificat la

source: This folder is empty.
ro_ro: Acest dosar nu conține niciun fișier.

source: Folder name already exists.
ro_ro: Nume dosar existent.

source: Name already exists.
ro_ro: Nume existent.

source: Error:
ro_ro: Eroare:

source: Hide
ro_ro: Ascundere

source: Root folder
ro_ro: Dosar rădăcină

source: Cancel
ro_ro: Renunțare

source: Move here
ro_ro: Mutare aici

source: New folder
ro_ro: Dosar nou

source: Upload file
ro_ro: Încărcare fișier

source: Rename resource
ro_ro: Redenumire resursă

source: Move selection
ro_ro: Mutare selecție

source: Delete selection
ro_ro: Ștergere selecție

source: Error loading student data.
ro_ro: Eroare la încărcare date studenți.

source: Error updating student data.
ro_ro: Eroare la actualizare studenți.

source: %s student enrolled
ro_ro: %s student înscris

source: Update student list
ro_ro: Modificare listă studenți

source: Add new folder
ro_ro: Adăugare dosar nou

source: Create folder
ro_ro: Creare dosar

source: Folder name
ro_ro: Nume dosar

source: Delete selection confirmation
ro_ro: Confirmare ștergere selecție

source: All selected files and folders will be permanently deleted.
ro_ro: Toate fișierele și dosarele selectate vor fi șterse permanent.

source: Rename
ro_ro: Redenumire

source: Resource name
ro_ro: Nume resursă

source: Invalid email
ro_ro: Email invalid

source: Change student list
ro_ro: Modificare listă studenți

source: Save changes
ro_ro: Salvare modificări

source: Type or paste email addresses and press `Enter`
ro_ro: Scrieți sau lipiți adrese de email și apăsați `Enter`

source: Remove
ro_ro: Eliminare

source: Clear all
ro_ro: Eliminare toate adresele

source: Zoom out
ro_ro: Micșorare imagine

source: Reset zoom
ro_ro: Resetare scalare

source: Zoom in
ro_ro: Mărire imagine

source: This file cannot be previewed.
ro_ro: Acest fișier nu poate fi previzualizat.

source: Download file
ro_ro: Descărcare fișier

source: Close
ro_ro: Închidere

source: Verification code sent
ro_ro: Cod de verificare trimis

source: Please input the verification code sent to your email address.
ro_ro: Introduceți codul de verificare trimis pe adresa de email introdusă.

source: Resend code
ro_ro: Retrimite codul

source: Login code
ro_ro: Cod de verificare

source: Verify code
ro_ro: Verificare cod

source: Change email address
ro_ro: Modifică adresă de email

source: Email address
ro_ro: Adresă de email

source: Login with email address
ro_ro: Conectare cu adresă email

source: Login failed
ro_ro: Autentificare eșuată

source: An email has already been sent to the specified email address. If you didn't receive the email try again in a minute.
ro_ro: Un email a fost trimis deja la adresa specificată. Dacă nu ați primit email-ul puteți reîncerca peste un minut.

source: The login email couldn't be sent.
ro_ro: Nu s-a putut trimite email-ul.

source: The email address is not enrolled in any course.
ro_ro: Adresa de email nu este înregistrată la niciun curs.

source: Invalid login code.
ro_ro: Cod de verificare invalid.

source: Internal server error while logging in.
ro_ro: Eroare internă la autentificare.

source: Student login
ro_ro: Autentificare student

source: Log out
ro_ro: Deconectare

source: You are not enrolled to any course.
ro_ro: Nu sunteți înscris la niciun curs.

source: Error loading page
ro_ro: Eroare la încărcarea paginii

source: An error has occured while loading the page
ro_ro: A apărut o eroare la încărcarea paginii

source: Back to course list
ro_ro: Înapoi la lista de cursuri

source: Content not found
ro_ro: Conținut inexistent

source: The requested page could not be found.
ro_ro: Pagina specificată nu a fost găsită.

source: Requested folder does not exist.
ro_ro: Dosarul specificat nu există.

source: Back to course page
ro_ro: Înapoi la pagina cursului

source: Error loading data
ro_ro: Eroare la încărcare date

source: An error has occured while loading data. Please try again later.
ro_ro: A apărut o eroare la încărcarea datelor. Reîncercați după câteva momente.

source: Access denied
ro_ro: Acces restricționat

source: You are not enrolled to this course.
ro_ro: Nu sunteți înscris la acest curs.
